# Reading and Writing in Pandas

#Using csv

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('drinks_dataset.csv')
df.head()

data = [[1,2,3],[4,5,6],[7,8,9]]
df1 = pd.DataFrame(data)
df1.to_csv("new_df.csv")

#Using pickle

In [5]:
data = [[1,2,3],[4,5,6],[7,8,9]]
df1 = pd.DataFrame(data)
df1.to_pickle("new_df.pkl")

df1 = pd.read_pickle("new_df.pkl")
df1.head()

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

# Pandas Series

#Creating pandas series from list/array

In [6]:
sr = pd.Series([1, 2, 3])
sr

0    1
1    2
2    3
dtype: int64

#Selecting a pandas series

In [7]:
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

# Renaming Columns

#Renaming Columns using rename method

In [8]:
df1.rename(columns={0:"zero", 1:"one", 2:"two"})

   zero  one  two
0     1    2    3
1     4    5    6
2     7    8    9

#Renaming columns by substuting entire list of column names

In [9]:
df1.columns = [1, 2, 3]
df1

   1  2  3
0  1  2  3
1  4  5  6
2  7  8  9

# Deleting Rows and Columns in pandas dataframe

#Removing single column using drop method

In [10]:
df1.drop(columns=[1], inplace=False)

   2  3
0  2  3
1  5  6
2  8  9

#Removing multiple columns using drop method

In [11]:
df1.drop(columns=[1, 2], inplace=False)

   3
0  3
1  6
2  9

#Removing rows from dataframe using drop method

In [12]:
df1.drop([1], axis=0, inplace=False)

   1  2  3
0  1  2  3
2  7  8  9

# Sorting Pandas dataframe or Series

#Sorting single pandas series using sort_values() method

In [13]:
df1[2].sort_values(ascending=False)

2    8
1    5
0    2
Name: 2, dtype: int64

#Sorting dataframe on the basis of a single column using sort_values() method

In [14]:
df1.sort_values(by=[2], ascending=False)

   1  2  3
2  7  8  9
1  4  5  6
0  1  2  3

#Sorting dataframe on the basis of a multiple columns using sort_values() method

In [15]:
df1.sort_values(by=[2, 1], ascending=False)

   1  2  3
2  7  8  9
1  4  5  6
0  1  2  3

# Filtering of rows using loc() and iloc() methods

#Filtering based on boolean values of selection criteria

In [16]:
df[df.wine_servings > 20].sum()

country                         AlbaniaAndorraAngolaAntigua & BarbudaArgentina...
beer_servings                                                               13297
spirit_servings                                                              9101
wine_servings                                                                8971
total_litres_of_pure_alcohol                                                580.3
continent                       EuropeEuropeAfricaNorth AmericaSouth AmericaOc...
dtype: object

#Filtering using loc and it's several variations

In [17]:
df.loc[:10, 'spirit_servings':'continent']

,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,0,0,0.0,Asia
1,132,54,4.9,Europe
2,0,14,0.7,Africa
3,138,312,12.4,Europe
4,57,45,5.9,Africa
5,128,45,4.9,North America
6,25,221,8.3,South America
7,179,11,3.8,Europe
8,72,212,10.4,Oceania
9,75,191,9.7,Europe
10,46,5,1.3,Europe

#Filtering using iloc and it's several variations

In [18]:
df.iloc[0:10, 1:4]

   beer_servings  spirit_servings  wine_servings
0              0                0              0
1             89              132             54
2             25                0             14
3            245              138            312
4            217               57             45
5            102              128             45
6            193               25            221
7             21              179             11
8            261               72            212
9            279               75            191

# Data type of pandas Series

#Using dtypes to get data type of each Series

In [19]:
df.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

#Using as_type() to change data type of a particular series

In [20]:
df['total_litres_of_pure_alcohol'] = df.total_litres_of_pure_alcohol.astype(int)
df.dtypes

country                         object
beer_servings                    int64
spirit_servings                  int64
wine_servings                    int64
total_litres_of_pure_alcohol     int32
continent                       object
dtype: object

# Groupby

#Grouping of dataframe of single column using groupby() method

In [21]:
g = df.groupby('continent')
for n, group in g:
    print(n)
    print(group.iloc[:5, :])

Africa
         country  beer_servings  spirit_servings  wine_servings  \
2        Algeria             25                0             14
4         Angola            217               57             45
18         Benin             34                4             13
22      Botswana            173               35             35
26  Burkina Faso             25                7              7

    total_litres_of_pure_alcohol continent
2                              0    Africa
4                              5    Africa
18                             1    Africa
22                             5    Africa
26                             4    Africa
Asia
        country  beer_servings  spirit_servings  wine_servings  \
0   Afghanistan              0                0              0
12      Bahrain             42               63              7
13   Bangladesh              0                0              0
19       Bhutan             23                0              0
24       Brunei             31                2              1

    total_litres_of_pure_alcohol continent
0                              0      Asia
12                             2      Asia
13                             0      Asia
19                             0      Asia
24                             0      Asia
Europe
       country  beer_servings  spirit_servings  wine_servings  \
1      Albania             89              132             54
3      Andorra            245              138            312
7      Armenia             21              179             11
9      Austria            279               75            191
10  Azerbaijan             21               46              5

    total_litres_of_pure_alcohol continent
1                              4    Europe
3                             12    Europe
7                              3    Europe
9                              9    Europe
10                             1    Europe
North America
              country  beer_servings  spirit_servings  wine_servings  \
5   Antigua & Barbuda            102              128             45
11            Bahamas            122              176             51
14           Barbados            143              173             36
17             Belize            263              114              8
32             Canada            240              122            100

    total_litres_of_pure_alcohol      continent
5                              4  North America
11                             6  North America
14                             6  North America
17                             6  North America
32                             8  North America
Oceania
              country  beer_servings  spirit_servings  wine_servings  \
8           Australia            261               72            212
40       Cook Islands              0              254             74
59               Fiji             77               35              1
89           Kiribati             21               34              1
106  Marshall Islands              0                0              0

     total_litres_of_pure_alcohol continent
8                              10   Oceania
40                              5   Oceania
59                              2   Oceania
89                              1   Oceania
106                             0   Oceania
South America
      country  beer_servings  spirit_servings  wine_servings  \
6   Argentina            193               25            221
20    Bolivia            167               41              8
23     Brazil            245              145             16
35      Chile            130              124            172
37   Colombia            159               76              3

    total_litres_of_pure_alcohol      continent
6                              8  South America
20                             3  South America
23                             7  South America
35                             7  South America
37                             4  South America

#Grouping of dataframe of single column using groupby() method and use of agg() method

In [22]:
df.groupby('continent').total_litres_of_pure_alcohol.agg(['count', 'mean', 'std'])

               count      mean       std
continent
Africa            53  2.566038  2.590734
Asia              44  1.863636  2.672782
Europe            45  8.155556  3.357187
North America     23  5.565217  2.332110
Oceania           16  3.062500  3.255124
South America     12  5.916667  1.564279

# Handling missing values

#Use of isnull() method to analyze count of missing values in a series

In [23]:
df.total_litres_of_pure_alcohol.isnull().sum()

0

#Use of dropna() method to drop rows with missing values and effect of how parameter

In [24]:
df.total_litres_of_pure_alcohol.dropna()

0       0
1       4
2       0
3      12
4       5
       ..
188     7
189     2
190     0
191     2
192     4
Name: total_litres_of_pure_alcohol, Length: 193, dtype: int32

# DataFrame Index

#Check DataFrame index using index() method

In [25]:
df.index

RangeIndex(start=0, stop=193, step=1)

#Use of set_index() method

In [26]:
df.set_index('wine_servings')

,country,beer_servings,spirit_servings,total_litres_of_pure_alcohol,continent
wine_servings,,,,,
0,Afghanistan,0,0,0,Asia
54,Albania,89,132,4,Europe
14,Algeria,25,0,0,Africa
312,Andorra,245,138,12,Europe
45,Angola,217,57,5,Africa
...,...,...,...,...,...
3,Venezuela,333,100,7,South America
1,Vietnam,111,2,2,Asia
0,Yemen,6,0,0,Asia
4,Zambia,32,19,2,Africa
4,Zimbabwe,64,18,4,Africa

#Restore previous index using reset_index() method

In [27]:
df.reset_index()

,index,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,0,Afghanistan,0,0,0,0,Asia
1,1,Albania,89,132,54,4,Europe
2,2,Algeria,25,0,14,0,Africa
3,3,Andorra,245,138,312,12,Europe
4,4,Angola,217,57,45,5,Africa
...,...,...,...,...,...,...,...
188,188,Venezuela,333,100,3,7,South America
189,189,Vietnam,111,2,1,2,Asia
190,190,Yemen,6,0,0,0,Asia
191,191,Zambia,32,19,4,2,Africa
192,192,Zimbabwe,64,18,4,4,Africa

# Dummy Variables

#Traditional Method: Use of map() method to assign dummy values to categorical data

In [28]:
df.continent.map({'Africa':1, 'Europe':2})

0      NaN
1      2.0
2      1.0
3      2.0
4      1.0
      ...
188    NaN
189    NaN
190    NaN
191    1.0
192    1.0
Name: continent, Length: 193, dtype: float64

#Pandas Method: Use of get_dummies() method to assign dummy values to categorical data

In [29]:
pd.get_dummies(df.continent)

     Africa  Asia  Europe  North America  Oceania  South America
0         0     1       0              0        0              0
1         0     0       1              0        0              0
2         1     0       0              0        0              0
3         0     0       1              0        0              0
4         1     0       0              0        0              0
..      ...   ...     ...            ...      ...            ...
188       0     0       0              0        0              1
189       0     1       0              0        0              0
190       0     1       0              0        0              0
191       1     0       0              0        0              0
192       1     0       0              0        0              0

[193 rows x 6 columns]

# Working with date and time variables

#Use of to_datetime() method

In [33]:
df3 = pd.read_csv("ufo_dataset.csv")

df3['Time'] = pd.to_datetime(df3.Time)
df3.head()

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00

#Use of dt.hour, dt.day, etc.

In [35]:
df3[df3.Time.dt.year > 1950]

                City Colors Reported Shape Reported State                Time
149     Palm Springs             NaN          CIGAR    CA 1951-01-20 04:30:00
150    Thompsonville             NaN           DISK    CT 1951-02-03 22:00:00
151      Los Angeles             NaN           DISK    CA 1951-02-15 11:00:00
152           Irving            BLUE           DISK    KS 1951-04-15 00:30:00
153        Fort Sill             NaN           OVAL    OK 1951-05-15 03:00:00
...              ...             ...            ...   ...                 ...
18236     Grant Park             NaN       TRIANGLE    IL 2000-12-31 23:00:00
18237    Spirit Lake             NaN           DISK    IA 2000-12-31 23:00:00
18238    Eagle River             NaN            NaN    WI 2000-12-31 23:45:00
18239    Eagle River             RED          LIGHT    WI 2000-12-31 23:45:00
18240           Ybor             NaN           OVAL    FL 2000-12-31 23:59:00

[18092 rows x 5 columns]

# Finding and Removing duplicate rows

#Use of duplicated() method

In [38]:
df3['City'].duplicated().sum()

11764

#Use of drop_duplicates() method

In [39]:
df3.drop_duplicates()

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,2000-12-31 23:00:00
18237,Spirit Lake,NaN,DISK,IA,2000-12-31 23:00:00
18238,Eagle River,NaN,NaN,WI,2000-12-31 23:45:00
18239,Eagle River,RED,LIGHT,WI,2000-12-31 23:45:00
18240,Ybor,NaN,OVAL,FL,2000-12-31 23:59:00